Revit 2027 API
FailureMessage.GetSeverity Method
 Retrieves the severity of the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureSeverity GetSeverity()
Public Function GetSeverity As FailureSeverity
public:
FailureSeverity GetSeverity()
member GetSeverity : unit -> FailureSeverity
Return Value
FailureSeverity
 The severity of the failure.
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace